[A_NecropolisVillageHall H7TownHall]
mName="村镇大厅"
mDesc="提供在本城建造全新建筑的场所。\n每天提供 500 %ICON_GOLD 黄金。"

[A_NecropolisTownHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供 500 %ICON_GOLD 黄金。"

[A_NecropolisCityHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供 1000 %ICON_GOLD 黄金。"

[A_NecropolisCapitol H7TownHall]
mName="国会"
mDesc="每天额外提供 2000 %ICON_GOLD 黄金。你只能拥有一个国会。"

[A_NecropolisFortification1 H7TownGuardBuilding]
mName="防御工事-等级1"
mDesc="为城市提供城墙和城门\n生产驻军单位直至驻军上限"

[A_NecropolisFortification2 H7TownGuardBuilding]
mName="防御工事-等级2"
mDesc="加固城堡城墙和城门\n增加最大驻军规模\n增加增长率"

[A_NecropolisFortification3 H7TownGuardBuilding]
mName="防御工事-等级3"
mDesc="加固城堡城墙和城门\n显著增加最大驻军规模\n降低增长率"

[A_NecropolisNamtaruTemple H7TownTower]
mName="娜姆塔茹神殿"
mDesc="在攻城战中为城镇提供2座塔楼。\n为防守军队中的单位增加+10 %ICON_ATTACK 攻击和+15 %ICON_DEFENSE 防御。"

[A_NecropolisMagicGuild1 H7TownMagicGuild]
mName="魔法行会-等级1"
mDesc="在本城镇提供7个随机的1阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_NecropolisMagicGuild2 H7TownMagicGuild]
mName="魔法行会-等级2"
mDesc="在本城镇提供6个随机的2阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_NecropolisMagicGuild3 H7TownMagicGuild]
mName="魔法行会-等级3"
mDesc="在本城镇提供4个随机的3阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_NecropolisMagicGuild4 H7TownMagicGuild]
mName="魔法行会-等级4"
mDesc="在本城镇提供2个随机的4阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_NecropolisHallOfHeroes H7TownBuilding]
mName="英雄大厅"
mDesc="提供招募新英雄和战败英雄的选项。新英雄的选择在每周开始时更换。"

[A_NecropolisGraveyard H7TownDwelling]
mName="墓地"
mDesc="核心生物住所。\n每周可招募25个骷髅。"

[A_NecropolisBoneyard H7TownDwelling]
mName="白骨墓地"
mDesc="核心生物住所升级。\n可招募并将骷髅升级为甲胄骷髅。\n（基础产量：25/周）"

[A_NecropolisPileOfBones H7TownGrowthEnhancer]
mName="骨堆"
mDesc="核心生物住所升级。\n每周骷髅或甲胄骷髅的产量+13。"

[A_NecropolisRuinedTower H7TownDwelling]
mName="废墟塔楼"
mDesc="核心生物住所。\n每周可招募18个幽灵。"

[A_NecropolisHauntedTower H7TownDwelling]
mName="鬼塔"
mDesc="核心生物住所升级。\n可招募并将幽灵升级为女妖。\n（基础产量：18/周）"

[A_NecropolisHowlingParapet H7TownGrowthEnhancer]
mName="哀嚎之墙"
mDesc="核心生物住所升级。\n每周幽灵或女妖的产量+9。"

[A_NecropolisSpiderNest H7TownDwelling]
mName="蜘蛛洞穴"
mDesc="核心生物住所。\n每周可招募10个黑檀蜘蛛。"

[A_NecropolisSpiderLair H7TownDwelling]
mName="蜘蛛巢穴"
mDesc="核心生物住所升级。\n可招募并将黑檀蜘蛛升级为织死蜘蛛。\n（基础产量：10/周）"

[A_NecropolisIckyWeb H7TownGrowthEnhancer]
mName="粘密蛛网"
mDesc="核心生物住所升级。\n每周黑檀蜘蛛或织死蜘蛛的产量+5。"

[A_NecropolisPestilentTomb H7TownDwelling]
mName="死亡墓穴"
mDesc="精英生物住所。\n每周可招募6个拉玛苏。"

[A_NecropolisPestilentCatacomb H7TownDwelling]
mName="死亡地宫"
mDesc="精英生物住所升级。\n可招募并将拉玛苏升级为瘟疫拉玛苏。\n（基础产量：6/周）"

[A_NecropolisDeepCatacomb H7TownGrowthEnhancer]
mName="幽邃地宫"
mDesc="精英生物住所升级。\n每周拉玛苏或瘟疫拉玛苏的产量+6。"

[A_NecropolisSepulcher H7TownDwelling]
mName="坟墓"
mDesc="精英生物住所。\n每周可招募6个尸巫。"

[A_NecropolisMausoleum H7TownDwelling]
mName="死亡陵墓"
mDesc="精英生物住所升级。\n可招募并将尸巫升级为大尸巫。\n（基础产量：6/周）"

[A_NecropolisMoonAltar H7TownGrowthEnhancer]
mName="暗月祭坛"
mDesc="精英生物住所升级。\n每周尸巫或大尸巫的产量+6。"

[A_NecropolisVampireMansion H7TownDwelling]
mName="吸血鬼宅邸"
mDesc="精英生物住所。\n每周可招募2个吸血鬼。"

[A_NecropolisVampirePalace H7TownDwelling]
mName="吸血鬼宫殿"
mDesc="精英生物住所升级。\n可招募并将吸血鬼升级为吸血鬼伯爵。\n（基础产量：2/周）"

[A_NecropolisBloodTank H7TownGrowthEnhancer]
mName="贮血池"
mDesc="精英生物住所升级。\n每周吸血鬼或吸血鬼伯爵的产量+2。"

[A_NecropolisCaveOfEternalWings H7TownDwelling]
mName="永恒之翼洞穴"
mDesc="冠军生物住所。\n每周可招募2个骨龙。"

[A_NecropolisPitOfEternalWings H7TownDwelling]
mName="永恒之翼深渊"
mDesc="冠军生物住所升级。\n可招募并将骨龙升级为鬼龙。\n（基础产量：2/周）"

[A_NecropolisDarkMoonStables H7TownDwelling]
mName="暗月马厩"
mDesc="冠军生物住所。\n每周可招募2个幽冥骑士。"

[A_NecropolisEternalMoonStables H7TownDwelling]
mName="永恒暗月马厩"
mDesc="冠军生物住所升级。\n可招募并将幽冥骑士升级为幽冥收割者。\n（基础产量：2/周）"

[A_Necropolis_chambre_des_vampire_originel H7TownDwelling]
mName="虚空之屋"
mDesc="冠军生物住所。\n可招募尸妖。\n可使用"全部招募"功能招募\n（基础产量：1/周）"

[A_Necropolis_chambre_des_seigneur_des_tenebre H7TownDwelling]
mName="吸血鬼宫殿"
mDesc="精英生物住所。\n可招募吸血鬼亲王。\n可使用"全部招募"功能招募\n（基础产量：4/周）"

[A_NecropolisNamtaruNest H7TownUtilityUnitDwelling]
mName="织命蛛女巢穴"
mDesc="战争单位生产。\n提供购买织命蛛女的选项。"

[A_NecropolisThievesGuild H7TownThiefGuild]
mName="潜行公会"
mDesc="提供支付获取对手信息的选项。"

[A_NecropolisEmbassy H7TownBuilding]
mName="外交大使"
mDesc="在此城镇控制区域内为你的英雄与中立军队谈判提供+15%成功率。"

[A_NecropolisResourceSilo H7TownSiloBuilding]
mName="物资仓库"
mDesc="每天随机提供1 %icon_Crystal 龙血水晶、%icon_Dragonsteel 龙钢、%icon_Shadowsteel 影钢或%icon_Starsilver 星银。"

[A_NecropolisAltarOfSacrifice H7TownUnitConverter]
mName="牺牲祭坛"
mDesc="每天提供400 %icon_gold 黄金和2 %icon_ore 矿石。"

[A_NecropolisMarketPlace H7TownMarketplace]
mName="集市"
mDesc="提供交易资源的选项。"

[A_NecropolisMoat H7TownMoat]
mName="护城河"
mDesc="在攻城战中为城镇装备护城河。\n踏入其中的敌方生物将被中断，受到暗系魔法伤害并获得虚弱效果。"

[A_NecropolisTownPortal H7TownPortal]
mName="城镇传送门"
mDesc="向所有拜访本城镇的英雄提供瞬间回城法术。\n使拥有此法术的英雄在这是最近的可用城镇时能够返回此城镇。"

[A_NecropolisMoonlightAmplifier H7TownBuilding]
mName="月光增益"
mDesc="在此城镇控制区域内，你的英雄施放的源力法术会提高一个等级。"

[A_NecropolisDragonbloodLaboratory H7TownBuilding]
mName="龙血实验室"
mDesc="每天提供1 %icon_Crystal 龙血水晶。"

[A_NecropolisAshasHourglass H7TownBuilding]
mName="亚莎的沙漏"
mDesc="在此城镇控制区域内，敌方英雄在陆地上移动速度降低20%，所有敌方生物的 %icon_initiative 主动性和 %icon_max_movement 移动力降低。"

[A_NecropolisChoirOfDespair H7TownBuilding]
mName="绝望颂唱"
mDesc="拜访英雄在接下来的3场战斗中降低敌方生物的 %ICON_MORALE 士气10点。"

[A_NecropolisTowerOfNecromancy H7TownBuilding]
mName="亡灵巫术塔"
mDesc="拜访的墓园英雄获得亡灵巫术加成，额外复活5%的被杀单位生命值。\n这不会改变每场战斗的单位上限"

[A_NecropolisAshasUndyingResolve H7TownBuilding]
mName="亚莎不屈之志"
mDesc="每天提供5000 %ICON_GOLD 黄金并增加此城镇 %buff6.buff.stat1% 的增长率。\n亡灵巫术每场战斗额外复活 %buff1.buff.stat% 的损失单位生命值。选项1"

[A_NecropolisAshasUndyingResolve_TearOfAsha H7TownTearOfAsha]
mName="亚莎不屈之志"
mDesc="每天提供5000 %ICON_GOLD 黄金并增加此城镇50%的生物产量。\n亡灵巫术率增加10个百分点。选项2"

[A_NecropolisAshasUndyingResolve H7TownTearOfAsha]
mName="亚莎不屈之志"
mDesc="每天提供5000 %ICON_GOLD 黄金并增加此城镇50%的生物产量。\n亡灵巫术以额外10个百分点复活生物。选项3"

[necropolisbuildingabilities.A_NecropolisAshasUndyingResolve_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[necropolisbuildingabilities.A_NecropolisAshasUndyingResolve_TownBuff H7BaseBuff]
mName="光龙之仁"
mTooltip=""

[necropolisbuildingabilities.A_NecropolisAshasHourglass_BuffHero H7BaseBuff]
mName="亚莎的沙漏"
mTooltip="英雄在陆地上移动速度降低20%，英雄军队中的所有生物在当前控制区域内获得 %buff1.buff.stat1 主动性和 %buff1.buff.stat2 移动力。"

[necropolisbuildingabilities.A_NecropolisAshasUndyingResolve_HeroBuff H7BaseBuff]
mName="亚莎不屈之志"
mTooltip="亡灵巫术每场战斗额外复活 %stat% 的损失单位生命值。"

[necropolisbuildingabilities.A_NecropolisChoirOfDespair_Buff_Creatures H7BaseBuff]
mName="绝望颂唱"
mTooltip="%stat %stat.icon 士气。"

[necropolisbuildingabilities.A_NecropolisAshasHourglass_BuffCreature H7BaseBuff]
mName="亚莎的沙漏"
mTooltip="当前控制区域内 %stat1 %stat1.icon 主动性和 %stat2 %stat2.icon 移动力。"

[necropolisbuildingabilities.A_NecropolisTowerOfNecromancy_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="亡灵巫术之塔能力"
mTooltip=""

[necropolisbuildingabilities.A_NecropolisMoonlightAmplifier_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[necropolisbuildingabilities.A_NecropolisAshasHourglass_BuffAlliedHero H7BaseBuff]
mName="亚莎的沙漏"
mTooltip=""

[necropolisbuildingabilities.A_NecropolisChoirOfDespair_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="绝望颂唱能力"
mTooltip=""

[necropolisbuildingabilities.A_NecropolisAshasHourglass_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="亚莎的沙漏能力"
mTooltip=""

[necropolisbuildingabilities.A_NecropolisMoonlightAmplifier_HeroBuff H7BaseBuff]
mName="月光增益"
mTooltip="在当前控制区域内，英雄的所有源力法术施放等级提高一阶。"

[necropolisbuildingabilities.A_NecropolisEmbassy_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[necropolisbuildingabilities.A_NecropolisChoirOfDespair_Buff_Hero H7BaseBuff]
mName="绝望颂唱"
mTooltip="接下来的 %durnow 场战斗中，敌方生物 %buff1.buff.stat %buff1.buff.stat.icon 士气。"

[necropolisbuildingabilities.A_NecropolisTowerOfNecromancy_Buff H7BaseBuff]
mName="亡灵巫术之塔"
mTooltip="亡灵巫术以额外 %stat.norm 个百分点复活生物。"

[necropolisbuildingabilities.A_NecropolisEmbassy_Buff H7BaseBuff]
mName="外交大使"
mTooltip="当前控制区域内对中立生物的外交成功几率增加15%。"

7.5 mod:

新增第8单位槽选项
新增牺牲祭坛以获取额外收入

v1.38

[A_NecropolisAshasUndyingResolve_TearOfAsha2 H7TownTearOfAsha]
mName="亚莎不屈之志"
mDesc="每天提供5000 %ICON_GOLD 黄金并增加此城镇50%的生物产量。\n亡灵巫术以额外10个百分点复活生物。"